src/CF/Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияКомпоненты</Name>
					<Comment>Версия компоненты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Comment>Уникальный идентификатор устройства стандарта оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоОтключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикДрайвера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/РабочиеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>РабочиеМеста</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СетевойПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/ПодключаемоеОборудование/Ext/ManagerModule.bsl
// sza140922-1531
// sza140902-1129 
// sza131227-0147 : 
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	// Функция возвращает список подключенного в справочнике ПО
	Функция   ПолучитьСписокОборудования(ТипыПО = Неопределено, Идентификатор = Неопределено, РабочееМесто = Неопределено) Экспорт
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ПодключаемоеОборудование.Ссылка КАК Ссылка,
		|	ПодключаемоеОборудование.ИдентификаторУстройства,
		|	ПодключаемоеОборудование.Наименование КАК Наименование,
		|	ПодключаемоеОборудование.ТипОборудования КАК ТипОборудования,
		|	ПодключаемоеОборудование.ОбработчикДрайвера КАК ОбработчикДрайвера,
		|	ПодключаемоеОборудование.РабочееМесто КАК РабочееМесто,
		|	РабочиеМеста.ИмяКомпьютера КАК ИмяКомпьютера,
		|	РабочиеМеста.СетевойПорт КАК СетевойПорт
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РабочиеМеста КАК РабочиеМеста
		|		ПО (РабочиеМеста.Ссылка = ПодключаемоеОборудование.РабочееМесто)
		|ГДЕ
		|	(НЕ ПодключаемоеОборудование.УстройствоОтключено)" +
		// Добавим в текст запроса условия-фильтры переданые в параметрах вызова
		?(Идентификатор = Неопределено,
		// Добавим в текст запроса фильтр по типам оборудования (если задан)
		?(ТипыПО <> Неопределено,
		"
		|	И (ПодключаемоеОборудование.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка))
		|	И (ПодключаемоеОборудование.ТипОборудования В (&ТипОборудования))
		|	И (РабочиеМеста.Ссылка = &РабочееМесто)",
		"
		|	И РабочиеМеста.Ссылка = &РабочееМесто"),
		// Добавим в текст запроса фильтр по конкретному устройству (имеет приоритет над другими фильтрами)
		"
		|	И (ПодключаемоеОборудование.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка))
		|	И (ПодключаемоеОборудование.Ссылка = &Идентификатор ИЛИ
		|	   ПодключаемоеОборудование.ИдентификаторУстройства = &Идентификатор)") +
		"
		|	И (НЕ ПодключаемоеОборудование.ПометкаУдаления)";
		
		// Добавим полученное условие отбора к тексту запроса
		ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО
		|	ТипОборудования,
		|	Наименование;";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		
		// Установим параметры запроса (фильтрующие выборку значения)
		Если Идентификатор = Неопределено Тогда
			// То используется фильтр по рабочему месту
			Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
				// Если РМ не задано в параметрах, то всегда текущее Из параметров сеанса
				РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
			КонецЕсли;
			
			Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
			// И возможно фильтр по типам оборудования
			Если ТипыПО <> Неопределено Тогда
				// Подготовка перечислений типов ТО для запроса
				МассивТиповПО = Новый Массив();
				Если ТипЗнч(ТипыПО) = Тип("Структура") Тогда
					Для Каждого ТипПО Из ТипыПО Цикл
						МассивТиповПО.Добавить(Перечисления.ТипыПодключаемогоОборудования[ТипПО.Ключ]);
					КонецЦикла;
					
				ИначеЕсли ТипЗнч(ТипыПО) = Тип("Массив") Тогда
					Для Каждого ТипПО Из ТипыПО Цикл
						МассивТиповПО.Добавить(Перечисления.ТипыПодключаемогоОборудования[ТипПО]);
					КонецЦикла;
					
				Иначе
					МассивТиповПО.Добавить(Перечисления.ТипыПодключаемогоОборудования[ТипыПО]);
				КонецЕсли;
				
				Запрос.УстановитьПараметр("ТипОборудования", МассивТиповПО);
			КонецЕсли;
		Иначе // Фильтр по конкретному устройству
			Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		// Перебирая выборку составляем список устройств
		СписокОборудования = Новый Массив();
		Пока Выборка.Следующий() Цикл
			ОбъектМетаданных = Выборка.ТипОборудования.Метаданные();
			ИндексЗначения = Перечисления[ОбъектМетаданных.Имя].Индекс(Выборка.ТипОборудования);
			ТипОборудованияИмя = ОбъектМетаданных.ЗначенияПеречисления.Получить(ИндексЗначения).Имя;
			// Заполним структуру данных очередного устройства
			ДанныеУстройства = Новый Структура();
			ДанныеУстройства.Вставить("Ссылка"                 , Выборка.Ссылка);
			ДанныеУстройства.Вставить("ИдентификаторУстройства", Выборка.ИдентификаторУстройства);
			ДанныеУстройства.Вставить("Наименование"           , Выборка.Наименование);
			ДанныеУстройства.Вставить("ТипОборудования"        , Выборка.ТипОборудования);
			ДанныеУстройства.Вставить("ОбработчикДрайвера"     , Выборка.ОбработчикДрайвера);
			ДанныеУстройства.Вставить("РабочееМесто"           , Выборка.РабочееМесто);
			ДанныеУстройства.Вставить("ИмяКомпьютера"          , Выборка.ИмяКомпьютера);
			ДанныеУстройства.Вставить("СетевойПорт"            , Выборка.СетевойПорт);
			ДанныеУстройства.Вставить("ТипОборудованияИмя"     , ТипОборудованияИмя);   
			СписокОборудования.Добавить(ДанныеУстройства);
		КонецЦикла;
		
		// Возвращаем полученный список с данными всех найденных устройств
		Возврат СписокОборудования;
		
	КонецФункции
	
	// Функция возвращает по идентификатору устройства его параметры
	// 
	Функция   ПолучитьПараметрыУстройства(Идентификатор) Экспорт
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ПодключаемоеОборудование.Параметры
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	ПодключаемоеОборудование.Ссылка = &Идентификатор ИЛИ
		|	ПодключаемоеОборудование.ИдентификаторУстройства = &Идентификатор
		|");
		
		Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Выборка.Следующий();
		
		Возврат Выборка.Параметры.Получить();
		
	КонецФункции
	
	// Процедура предназначена для сохранения параметров устройства
	// в реквизит Параметры типа хранилище значения в элементе справочника
	Функция   СохранитьПараметрыУстройства(Идентификатор, Параметры) Экспорт
		
		Попытка
			Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	ПодключаемоеОборудование.Ссылка
			|ИЗ
			|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
			|ГДЕ
			|	ПодключаемоеОборудование.Ссылка = &Идентификатор ИЛИ
			|	ПодключаемоеОборудование.ИдентификаторУстройства = &Идентификатор
			|");
			
			Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
			ТаблицаРезультатов = Запрос.Выполнить().Выгрузить();
			
			ОбъектСправочника = ТаблицаРезультатов[0].Ссылка.ПолучитьОбъект();
			ОбъектСправочника.Параметры = Новый ХранилищеЗначения(Параметры);
			ОбъектСправочника.Записать();
			
			Результат = ИСТИНА;
		Исключение
			Результат = ЛОЖЬ;
		КонецПопытки;
		
		Возврат Результат;
		
	КонецФункции
	
	// Функция возвращает структуру с данными устройства
	// (со значениями реквизитов элемента справочника)
	Функция   ПолучитьДанныеУстройства(Идентификатор) Экспорт
		
		ДанныеУстройства = Новый Структура();
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	СпрПодключаемоеОборудование.Ссылка,
		|	СпрПодключаемоеОборудование.ИдентификаторУстройства КАК ИдентификаторУстройства,
		|	СпрПодключаемоеОборудование.Наименование КАК Наименование,
		|	СпрПодключаемоеОборудование.ТипОборудования КАК ТипОборудования,
		|	СпрПодключаемоеОборудование.ОбработчикДрайвера КАК ОбработчикДрайвера,
		|	СпрПодключаемоеОборудование.РабочееМесто КАК РабочееМесто,
		|	РабочиеМеста.ИмяКомпьютера Как ИмяКомпьютера,
		|	РабочиеМеста.СетевойПорт
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК СпрПодключаемоеОборудование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМеста КАК РабочиеМеста
		|		ПО СпрПодключаемоеОборудование.РабочееМесто = РабочиеМеста.Ссылка
		|ГДЕ
		|	(СпрПодключаемоеОборудование.ИдентификаторУстройства = &Идентификатор
		|			ИЛИ СпрПодключаемоеОборудование.Ссылка = &Идентификатор)
		|");
		
		Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ДанныеУстройства.Вставить("Ссылка"                 , Выборка.Ссылка);
			ДанныеУстройства.Вставить("ИдентификаторУстройства", Выборка.ИдентификаторУстройства);
			ДанныеУстройства.Вставить("Наименование"           , Выборка.Наименование);
			ДанныеУстройства.Вставить("ТипОборудования"        , Выборка.ТипОборудования);
			ДанныеУстройства.Вставить("ОбработчикДрайвера"     , Выборка.ОбработчикДрайвера);
			ДанныеУстройства.Вставить("РабочееМесто"           , Выборка.РабочееМесто);
			ДанныеУстройства.Вставить("ИмяКомпьютера"          , Выборка.ИмяКомпьютера);
			ДанныеУстройства.Вставить("СетевойПорт"            , Выборка.СетевойПорт);
		КонецЕсли;
		
		Возврат ДанныеУстройства;
		
	КонецФункции
	
#КонецЕсли

Процедура НаПечать(ДокументДляПечати, Ссылка) Экспорт
	
	Макет = Справочники.ПодключаемоеОборудование.ПолучитьМакет("НаПечать");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПодключаемоеОборудование.ВерсияКомпоненты,
	|	ПодключаемоеОборудование.ДатаРедакции,
	|	ПодключаемоеОборудование.ДатаСоздания,
	|	ПодключаемоеОборудование.ИдентификаторУстройства,
	|	ВЫРАЗИТЬ(ПодключаемоеОборудование.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	ПодключаемоеОборудование.Наименование,
	|	ПодключаемоеОборудование.ОбработчикДрайвера,
	|	ПодключаемоеОборудование.Ответственный,
	|	ПодключаемоеОборудование.Параметры,
	|	ПодключаемоеОборудование.РабочееМесто,
	|	ПодключаемоеОборудование.ТипОборудования,
	|	ПодключаемоеОборудование.ТребуетсяПереустановка,
	|	ПодключаемоеОборудование.УстройствоИспользуется,
	|	ПодключаемоеОборудование.УстройствоОтключено
	|ИЗ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ ПодключаемоеОборудование.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	ДокументДляПечати.ИмяПараметровПечати  = "Оборудование" + СокрЛП(ИмяКомпьютера());
	ДокументДляПечати.КлючПараметровПечати = ДокументДляПечати.ИмяПараметровПечати;
	
	ДокументДляПечати.Очистить();
	
	ВставлятьРазделительСтраниц = ЛОЖЬ;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ДокументДляПечати.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
		ДокументДляПечати.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
		ДокументДляПечати.Вывести(Шапка, Выборка.Уровень());
		
		ВставлятьРазделительСтраниц = ИСТИНА;
	КонецЦикла;
	
КонецПроцедуры
